export default function GiftcardAgreement() {
  return (
    <>
      {/* Section 1 */}
      <section className="m-b-25" id="section-1">
        <h4>제1조 (목적)</h4>
        <p>
          이 약관은 클로젯(이하 ‘발행자’라 함)이 발행한 상품권을 그 소지자(이하
          ‘고객’이라 함)가 사용함에 있어 고객과 발행자 및 발행자와 가맹계약을
          맺은 자(이하 ‘사용처’라 함) 간에 준수할 사항을 규정한다.
        </p>
      </section>

      {/* Section 2 */}
      <section className="m-b-25" id="section-2">
        <h4>제2조 (적용의 범위)</h4>
        <p>
          이 약관의 적용을 받는 상품권은 다음과 같다:
          <ul>
            <li>
              <span style={{ fontWeight: 'bold' }}>종이상품권</span>: 상품권의
              권면에 기재된 금액에 상응하는 물품 또는 용역(이하 물품 등이라
              함)을 제공받을 수 있는 금액 상품권으로서 실물로 된 상품권으로
              클로젯상품권이라 명한다.
            </li>
            <li>
              <span style={{ fontWeight: 'bold' }}>
                모바일상품권(전용 모바일상품권)
              </span>
              : 상품권의 권면에 기재된 금액에 상응하는 물품 또는 용역을 제공받을
              수 있는 금액 상품권으로서 무선 통화기기(휴대폰, 스마트폰, 태블릿PC
              등)를 통해 카카오 알림톡 또는 MMS 형태로 발송되는 상품권을 말하며
              클로젯 모바일상품권이라 명한다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 3 */}
      <section className="m-b-25" id="section-3">
        <h4>제3조 (발행)</h4>
        <p>
          발행자는 상품권 발행 시 상품권과 관련된 주요 정보 사항을 표시하여야
          하며, 표시사항은 아래와 같다:
          <ul>
            <li>발행자: SN패션그룹(주)</li>
            <li>구매가격(할인된 경우 할인율 및 할인금액): 상품권 참조</li>
            <li>유효기간(유효기간이 설정된 경우에 한함): 제6조 참조</li>
            <li>사용조건(사용가능 금액, 제공 물품 등): 상품권 참조</li>
            <li>사용가능 가맹점: 상품권 참조</li>
            <li>환불 조건 및 방법: 제7조 참조</li>
            <li>
              이 상품권은 별도의 지급보증 및 피해보상보험계약 없이 발행자의
              신용으로 발행되었습니다.
            </li>
            <li>소비자피해발생 시 연락할 관련 전화번호: 1577-0000</li>
          </ul>
        </p>
        <p>
          상품권 발행 시 소요되는 제반 비용(문자메시지 발송, 카드의 발급 비용
          등)은 발행자가 부담한다.
        </p>
      </section>

      {/* Section 4 */}
      <section className="m-b-25" id="section-4">
        <h4>제4조 (상품권의 사용)</h4>
        <p>
          <span style={{ fontWeight: 'bold' }}>1. 클로젯 상품권</span>
          <ul>
            <li>
              상품권은 발행자와 가맹 제휴 계약이 체결된 온라인 사용처에서만
              사용할 수 있다.
            </li>
            <li>
              고객이 상품권면 금액 또는 수량의 범위 내에서 물품 등의 제공을
              요구하는 경우 발행자 또는 사용처는 즉시 해당 물품 등을 제공한다.
            </li>
            <li>
              상품권은 상품권 전면에 있는 스크래치의 개봉 여부에 따라 온라인
              또는 오프라인 매장에서 사용할 수 있다. 스크래치가 개봉되어
              PIN번호가 노출된 상품권은 온라인에서 사용한 것으로 간주되어
              오프라인 사용처에서는 사용할 수 없다.
            </li>
          </ul>
        </p>
        <p>
          <span style={{ fontWeight: 'bold' }}>
            2. 클로젯 모바일상품권(전용 모바일상품권)
          </span>
          <ul>
            <li>
              클로젯 모바일상품권은 발행자와 가맹 제휴 계약이 체결된 온라인
              사용처에서 적립금으로 전환하여 사용하거나 가맹 계약이 체결된
              오프라인 사용처에서 사용할 수 있다.
            </li>
            <li>
              PIN번호 또는 인증번호가 소지자의 관리 소홀로 노출된 경우, 발행자는
              상품권의 재발급 및 사용을 거부할 수 있다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 5 */}
      <section className="m-b-25" id="section-5">
        <h4>제5조 (상품권의 훼손 및 도난, 분실)</h4>
        <p>
          <ul>
            <li>
              상품권의 훼손이란 관리번호, 권면금액 등이 확인 가능하나, 유관상
              파손 정도가 심각하여 사용처에서 사용하기 어려운 경우를 말한다.
            </li>
            <li>
              훼손된 상품권은 제8조(상품권의 교환)에 따라 발행자가 교환하며,
              교환 비용은 고객이 부담한다.
            </li>
            <li>
              상품권의 도난, 분실 등에 대해 발행자는 책임을 지지 않으며
              재발행하지 않는다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 6 */}
      <section className="m-b-25" id="section-6">
        <h4>제6조 (유효기간)</h4>
        <p>
          <ul>
            <li>
              클로젯 상품권과 클로젯 모바일상품권(전용 모바일상품권)은 상사채권
              소멸시효(발행일로부터 5년) 이내에만 사용할 수 있다. 단, 클로젯
              모바일상품권은 ‘구입일’로부터 1년을 사용유효기간으로 하며, 3개월
              단위로 사용유효기간을 연장할 수 있다. 연장은 고객센터 요청 또는
              클로젯 홈페이지에서 가능하다.
            </li>
            <li>
              발행자가 진행하는 이벤트와 다른 업체와 제휴하여 발행한 특정
              상품권의 유효기간은 상품권면 또는 사용안내 내역에 기재된 기간으로
              제한된다.
            </li>
            <li>
              클로젯 모바일상품권은 유효기간이 도래하기 7일 전에 고객에게 이메일
              또는 문자메시지로 유효기간 연장 가능 여부와 방법을 포함하여 최소
              3회 통지한다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 7 */}
      <section className="m-b-25" id="section-7">
        <h4>제7조 (상품권의 환불)</h4>
        <p>
          <ul>
            <li>
              상품권은 현금으로 반환하지 않는다. 단, 발행자의 귀책사유가
              인정되는 경우 전액 반환한다.
            </li>
            <li>
              상사채권 소멸시효가 경과한 상품권은 사용 및 환불이 불가하다.
            </li>
            <li>
              클로젯상품권은 유효기간 전 사용처에서 권면 금액의 60% 이상 사용 시
              잔액을 현금으로 반환한다. 단, 일부 사용처는 별도 환불규정을 따를
              수 있다.
            </li>
            <li>
              클로젯 모바일상품권은 유효기간 내 1만 원 이하 사용 시 80%, 1만 원
              초과 사용 시 60% 이상 사용한 경우 잔액을 환불한다. 유효기간 경과
              시 판매금액 기준 잔액의 90%를 반환한다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 8 */}
      <section className="m-b-25" id="section-8">
        <h4>제8조 (상품권의 주문취소 및 반품)</h4>
        <p>
          <ul>
            <li>
              상품권의 배송 전 주문취소 요청 시 결제 방법에 따라 취소 처리가
              이루어진다.
            </li>
            <li>
              상품권 배송 완료 후 주문취소 또는 반품 요청 시, 배송 완료일로부터
              14일 이내 정상 상품권을 발행자에게 반송해야 한다. 배송 완료 시점은
              배송현황 조회내역 기준이다.
            </li>
            <li>
              반품 시 고객이 반송 운송비를 부담하며, 발행자가 최초 운송비를
              부담한 경우 반품 시 해당 금액을 동봉해야 한다.
            </li>
            <li>
              클로젯 모바일상품권은 구매일로부터 7일 이내 미사용건에 대해 전액
              환불된다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 9 */}
      <section className="m-b-25" id="section-9">
        <h4>제9조 (상품권의 교환)</h4>
        <p>
          <ul>
            <li>
              종이상품권은 상사채권 소멸시효 이내, 전액 미사용, 훼손되지 않은
              경우 동일 상품권으로 교환할 수 있다. 스크래치 훼손, 인쇄 오류 등은
              교환이 가능하다.
            </li>
            <li>
              교환 시 고객은 상품권 한 장당 100원의 교환수수료와 반송 우편료 3천
              원을 부담한다.
            </li>
            <li>
              클로젯 모바일상품권은 물품 제공이 불가능하거나 지체되는 경우 동일
              가치의 다른 상품권으로 교환하거나 구매액을 반환한다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 10 */}
      <section className="m-b-25" id="section-10">
        <h4>제10조 (발행자의 책임)</h4>
        <p>
          <ul>
            <li>
              상품권 이용과 관련된 고객의 권리에 대한 최종 책임은 발행자가 진다.
            </li>
            <li>
              데이터 위조 또는 변조로 고객에게 피해가 발생한 경우 발행자는
              책임을 지며, 천재지변 등 불가항력적 사유가 입증되면 예외로 한다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 11 */}
      <section className="m-b-25" id="section-11">
        <h4>제11조 (지급보증)</h4>
        <p>
          상품권은 별도의 지급보증 및 피해보상보험계약 없이 발행자의 신용으로
          발행되었다.
        </p>
      </section>

      {/* Section 12 */}
      <section className="m-b-25" id="section-12">
        <h4>제12조 (약관의 변경 및 공지)</h4>
        <p>
          <ul>
            <li>
              발행자는 새로운 업무 적용, 정부 시정명령 등으로 약관을 변경할 수
              있다.
            </li>
            <li>본 약관은 회사 홈페이지에 공지함으로써 효력을 발생한다.</li>
            <li>
              변경된 약관은 적용일자 도래 전 최소 1주일간 홈페이지에 게시된다.
            </li>
          </ul>
        </p>
      </section>

      {/* Section 13 */}
      <section className="m-b-25" id="section-13">
        <h4>제13조 (기타)</h4>
        <p>
          약관에 명시되지 않은 사항 또는 해석상 분쟁이 있는 경우, 고객과 발행자
          또는 사용처의 합의에 따르며, 합의되지 않을 경우 관련 법령 및 거래
          관행에 따른다.
        </p>
      </section>

      {/* Section 14 */}
      <section className="m-b-25" id="section-14">
        <h4>제14조 (마케팅 정보 수신 동의)</h4>
        <p>
          <ul>
            <li>
              광고성 정보 전송을 위해 수신자의 사전 동의를 받으며, 정기적으로
              확인한다.
            </li>
            <li>
              전송 방법: 모바일 App Push, 문자(SMS), Email, 카카오톡(알림톡,
              브랜드톡) 등을 통해 전달된다.
            </li>
            <li>
              전송 내용: 포인트, 쿠폰, 이벤트 등 광고성 정보로 법규를 준수하여
              발송되며, 정보성 내용은 수신동의와 무관하게 제공된다.
            </li>
            <li>
              수신 동의 철회는 클로젯 홈페이지 또는 고객센터(1588-0000)를 통해
              가능하다.
            </li>
          </ul>
        </p>
      </section>

      <section className="d-flex flex-col p-t-15">
        <span>부 칙(시행일)</span>
        <span>이 약관은 2024년 12월 10일부터 시행합니다.</span>
      </section>
    </>
  );
}
