// import CSS
import '../../assets/styles/components/footer.css';

export default function Guide() {
  return (
    <>
      <h3 className="guide-subtitle">이용안내</h3>

      <div className="container mb-5">
        <div className="row">
          <div className="col-1"></div>
          <div className="col-2 pt-3 guide-link">
            <div>
              <a className="active-link" href="#">
                회원가입 안내
              </a>
            </div>

            <div>
              <a href="#">주문 안내</a>
            </div>

            <div>
              <a href="#">결제 안내</a>
            </div>

            <div>
              <a href="#">배송 안내</a>
            </div>

            <div>
              <a href="#">교환/반품 안내</a>
            </div>

            <div>
              <a href="#">환불 안내</a>
            </div>

            <div>
              <a href="#">기타 안내</a>
            </div>
          </div>

          <div className="col-8 pt-3 ps-5 guide-content">
            <div className="guide-box guide-signup">
              <h5>회원가입 안내</h5>

              <p>안녕하세요! 클로젯에 오신 것을 환영합니다.</p>

              <p>
                클로젯의 콘텐츠와 다양한 서비스를 이용하시려면 회원가입이
                필요합니다.
              </p>

              <p>회원가입 시 필요한 개인정보는 다음과 같습니다:</p>
              <span>아이디, 비밀번호, 닉네임, 생년월일, 이메일</span>

              <p>
                회원가입을 완료하시면 당사의 이용약관 및 개인정보 보호정책에
                동의하신 것으로 간주됩니다.
              </p>

              <p>
                또한, 회원가입 시 <b>500 포인트</b>를 즉시 지급해 드리며,
                클로젯의 모든 이벤트에 참여할 수 있습니다.
              </p>

              <p> 포인트는 다양한 상품 구매 시 사용 가능합니다.</p>
            </div>

            <div className="guide-box guide-order">
              <h5>주문 안내</h5>

              <p className="mb-3">상품을 주문하는 방법은 다음과 같습니다:</p>

              <div className="order-step">
                <p>- Step1&nbsp;&nbsp;&nbsp;🔑 회원가입 후 로그인</p>
                <p>
                  - Step2&nbsp;&nbsp;&nbsp;🔍 카테고리와 필터 기능을 이용하여
                  원하는 상품 찾기
                </p>
                <p>- Step3&nbsp;&nbsp;&nbsp;🛒 상품을 장바구니에 추가</p>
                <p>- Step4&nbsp;&nbsp;&nbsp;📃 주문서 작성 및 배송 정보 입력</p>
                <p>- Step5&nbsp;&nbsp;&nbsp;💳 결제방법 선택 및 결제 진행</p>
                <p>
                  - Step6&nbsp;&nbsp;&nbsp;✔ 주문 완료 확인 (주문번호 발급)
                </p>
              </div>
            </div>

            <div className="guide-box guide-payment">
              <h5>결제 안내</h5>

              <div className="payment-box">
                <h6 className="mb-2">카드결제</h6>
                <p>카드결제는 결제 시 결제 정보를 입력하여 진행합니다.</p>

                <p>
                  해외 카드, 마스터카드 등 일부 카드사는 결제가 제한될 수
                  있습니다. 이 경우 다른 결제 수단을 이용해 주시기 바랍니다.
                </p>

                <p>
                  카드 결제 시 <b>부분 취소가 불가능</b>하며, 부분 취소를 원하실
                  경우 전체 취소 후 재구매를 진행해 주셔야 합니다.
                </p>

                <p>
                  귀사의 사유로 인해 부분 취소가 필요한 경우, 상담시간 내에
                  고객센터(1588-0000) 또는 카카오 상담톡, 네이버 톡톡을 통해
                  문의해 주시면 안내해 드리겠습니다.
                </p>
              </div>

              <div className="payment-box">
                <h6 className="mb-2">간편결제</h6>
                <p>
                  클로젯은 <b>네이버페이</b>와 <b>카카오페이</b>를 통한
                  간편결제를 지원합니다.
                </p>

                <p>
                  간편결제를 통해 빠르고 안전하게 결제할 수 있으며, 사이트에서의
                  추가적인 인증 과정 없이 바로 결제 가능합니다.
                </p>

                <p>
                  결제 과정에서 문제가 발생한 경우 고객센터(1588-0000) 또는
                  카카오 상담톡, 네이버 톡톡으로 문의 부탁드립니다.
                </p>

                <p>
                  단, 간편결제의 취소 및 환불 정책은 각 서비스(네이버페이,
                  카카오페이)의 정책을 따릅니다.
                </p>
              </div>

              <div className="payment-box">
                <h6 className="mb-2">무통장 입금</h6>
                <p>
                  무통장 입금 주문 시 <b>입력한 입금자명</b>과{' '}
                  <b>실제 입금자의 성명</b>이 반드시 일치하여야 하며,{' '}
                  <b>주문서의 입금액</b>과 <b>입금은행</b>이 모두 일치해야
                  합니다.
                </p>

                <p>
                  주문 후 3일 이내로 입금을 하셔야 하며, 입금자가 동일하지 않은
                  경우 고객센터로 연락을 주셔야 주문 처리가 가능합니다.
                </p>

                <p>
                  부분 취소를 원하실 경우 고객센터(1588-0000) 또는 카카오
                  상담톡, 네이버 톡톡을 통해 문의해 주시면 해당 상품의 비용을
                  환불 처리 후 취소가 가능합니다.
                </p>

                <p className="mb-3">
                  입금 계좌는 결제 완료 페이지에서도 확인이 가능하며, 3일 이내에
                  입금되지 않는 주문은 자동 취소됩니다.
                </p>

                <p>카카오뱅크 &nbsp;3333-02-9915018</p>
                <p>
                  예금주&nbsp;&nbsp;
                  <span
                    style={{
                      display: 'inline',
                      margin: '0',
                      fontWeight: 'normal',
                    }}
                  >
                    (주)
                  </span>
                  클로젯
                </p>
              </div>

              <div className="payment-box">
                <h6 className="mb-2">휴대폰 결제</h6>
                <p>
                  각 통신사의 휴대폰 소액결제를 통해 상품을 결제하실 수
                  있습니다.
                </p>

                <p>결제 취소는 결제하신 달의 1일에서 말일 이내에 가능합니다.</p>

                <p>말일 이후에는 취소가 불가합니다.</p>

                <p>
                  취소 기간이 지난 후에 취소를 원하실 경우 고객센터(1577-0000)
                  또는 카카오 상담톡, 네이버 톡톡으로 문의해주시면 현금 또는
                  포인트로 환불받으실 수 있습니다.
                </p>

                <p>
                  휴대폰 소액결제는 부분 취소 처리가 불가하며, 전체 취소만
                  가능합니다.
                </p>
              </div>
            </div>

            <div className="guide-box guide-delivery">
              <h5>배송 안내</h5>
              <div className="delivery-information mb-4">
                <p>배송 방법: GS택배</p>

                <p>배송 지역: 전국</p>

                <p>배송 비용:</p>
                <div className="mb-2">
                  <span>주문 금액이 50,000원 미만일 시 배송비 3,000원</span>
                  <span>주문 금액이 50,000원 이상일 시 배송비 무료</span>
                  <span>산간지역, 제주 2,000원 추가</span>
                </div>

                <p>출고일: 1일 ~ 2일</p>

                <p>예상 배송 기간: 3일 ~ 5일</p>
              </div>

              <div className="delivery-description">
                <p>
                  주문하신 모든 상품은 입금이 확인된 후에 출고가 진행됩니다.
                </p>

                <p>또한, 상품의 재고에 따라 출고가 다소 지연될 수 있습니다.</p>

                <p>
                  2일 이내에 상품이 출고되지 않을 시 교환, 환불 처리 받으실 수
                  있습니다.
                </p>

                <p>
                  배송업체의 상황에 따라 예상 배송 기간과 차이가 있을 수
                  있습니다.
                </p>
              </div>
            </div>

            <div className="guide-box guide-exchange">
              <h5>교환/반품 안내</h5>
              <div className="exchange-description mb-4">
                <p>
                  교환 및 반품은 <b>상품 수령일로부터 14일 이내</b>에
                  가능합니다.
                </p>

                <p>
                  <b>단순 변심</b>에 의한 교환 및 반품은 <b>월 2회, 연 10회</b>
                  까지 가능하며, 상품에 심각한 훼손이 있을 경우 요청이 거부될 수
                  있습니다.
                </p>

                <p>
                  상품에 문제가 있거나 귀사의 실수로 인한 교환은 배송비가
                  청구되지 않습니다. 이 경우 동일 금액 내에서 다른 상품으로 교환
                  가능합니다.
                </p>

                <p>
                  원 상품 금액을 초과하는 상품으로 교환을 원하실 경우 차액과
                  배송비를 부담하셔야 하며, 이 경우 교환 횟수는 차감되지
                  않습니다.
                </p>
              </div>

              <h6>교환/반품 방법</h6>
              <div className="guide-process mt-2 mb-4">
                <p>
                  교환/반품 시 <b>GS택배</b>를 통해 발송해 주세요.
                </p>
                <p>타 배송업체 이용 시 택배비를 선불로 지불하셔야 합니다.</p>
                <p>
                  타 배송업체를 통한 착불 발송의 경우, 추가 착불 요금이 청구될
                  수 있습니다.
                </p>
              </div>

              <h6 className="mb-2">문의 사항</h6>
              <p>
                교환/반품에 대한 추가 문의는 고객센터를 통해 빠르게 상담받으실
                수 있습니다:
              </p>
              <span>고객센터: 1577-0000</span>
            </div>

            <div className="guide-box guide-refund">
              <h5>환불 안내</h5>
              <p className="mb-4">
                환불 처리는 반품된 물품을 수령받은 후 곧바로 진행되며, 최대{' '}
                <b>7 영업일 이내</b>로 완료됩니다.
              </p>

              <h6>카드 결제 환불</h6>
              <div className="refund-card mt-2 mb-4">
                <p>
                  카드 취소의 경우, 전체 취소 또는 부분 취소 접수 후 카드사
                  영업일 기준 <b>7 영업일 이내</b>에 결제 금액이 환불됩니다.
                </p>

                <p>
                  카드 결제 시 카드사의 할인 혜택이 적용된 경우{' '}
                  <b>부분 취소가 불가</b>합니다.
                </p>
                <p>
                  이 경우 전체 취소를 진행하신 후 취소하실 상품 금액을
                  재결제하시면 할인 혜택을 다시 제공받으실 수 있습니다.
                </p>

                <p>
                  신용카드 결제 건의 경우, 카드 승인 취소를 통해 결제 대금이
                  청구되지 않도록 처리합니다.
                </p>

                <p>
                  다만, 신용카드 결제일에 따라 대금이 먼저 청구될 수 있으며 이
                  경우 익월 카드사 대금 청구 시 환급 처리됩니다.
                </p>
              </div>

              <h6>간편결제 환불</h6>
              <div className="refund-smartpay mt-2 mb-4">
                <p>간편결제 환불은 각 서비스의 포인트로 환급 처리됩니다.</p>

                <p>
                  부분 취소가 불가하며 일부 상품을 주문 취소하실 경우 전체 취소
                  후 재결제하셔야 합니다.
                </p>
              </div>

              <h6>무통장 입금 환불</h6>
              <div className="refund-nonAccount mt-2 mb-4">
                <p>
                  무통장 입금의 경우, 환불 접수 완료 후{' '}
                  <b>영업일 기준 2일 ~ 3일 이내</b>로 환불 처리됩니다.
                </p>

                <p> 환불 처리 기간은 각 은행마다 다를 수 있습니다.</p>
              </div>

              <h6>휴대폰 결제 환불</h6>
              <div className="refund-phone mt-2 mb-4">
                <p>
                  휴대폰 소액결제 취소는 <b>당월 1일 ~ 말일 이내</b>에
                  가능합니다. 말일 이후에는 취소가 불가합니다.
                </p>

                <p>
                  당월 이후에 취소를 진행하실 경우 고객센터(1577-0000) 또는
                  카카오 상담톡, 네이버 톡톡으로 문의해 주시기 바랍니다.
                </p>

                <p>
                  현금 환급을 요청하실 경우 취소 처리가 다소 지연될 수 있으며,
                  포인트 환불은 당일 처리됩니다.
                </p>
              </div>

              <h6>포인트 환불</h6>
              <div className="refund-point mt-2 mb-4">
                <p>
                  포인트가 포함된 주문건의 경우, 환불 요청 시 사용하신 포인트가
                  우선 환불됩니다.
                </p>

                <p>실결제 금액은 각 결제수단의 환불 절차에 따릅니다.</p>

                <p>
                  사용하신 쿠폰은 1회성으로 <b>환불 시 소멸</b>되며, 복구되지
                  않습니다.
                </p>
              </div>
            </div>

            <div className="guide-box end guide-etc">
              <h5>기타 안내</h5>

              <h6>포인트 안내</h6>

              <div className="etc-point mt-2 mb-4">
                <p>
                  "클로젯"의 포인트는 사이트 내에서 현금처럼 사용 가능한
                  재화입니다.
                </p>

                <p>
                  각종 활동을 통해 포인트를 지급받으실 수 있으며, 지급받은
                  포인트는 즉시 사용 가능합니다.
                </p>

                <p>
                  포인트 유효기간은 1년이며 미사용된 포인트는 자동으로
                  소멸됩니다.
                </p>

                <p>
                  회원탈퇴 시 포인트는 즉시 소멸되며, 재가입 시에 복구되지
                  않습니다.
                </p>

                <div className="point-description mt-4">
                  <h6>상품 구매 포인트 안내</h6>
                  <div className="purchase-point-description mt-1">
                    <p>
                      - 상품 구매 시 구매 금액의 5%가 적립됩니다. 이는 최소
                      적립율이며 회원 등급에 따라 차이가 있을 수 있습니다.
                    </p>

                    <p>
                      - 구매 금액은 실결제 금액을 기준으로 하며 쿠폰, 이벤트
                      등으로 할인받은 금액은 포함되지 않습니다.
                    </p>
                  </div>

                  <h6 className="mt-2">상품 구매 포인트 지급 적용 기준</h6>
                  <div className="purchase-point-standard mt-1">
                    <p>- 브론즈: 5%</p>
                    <p>- 실버: 7.5%</p>
                    <p>- 골드: 10%</p>
                  </div>

                  <h6 className="mt-2">리뷰 작성 포인트 안내</h6>
                  <div className="review-point-description mt-1">
                    <p>- 리뷰 작성 시 포인트가 지급됩니다.</p>

                    <p>- 최소 20자 이상의 리뷰를 입력해주셔야 합니다.</p>

                    <p>
                      - 착용사진의 경우 전신 사진이어야 하며, 전체적인
                      스타일링을 확인 가능한 경우에만 사진 포함 리뷰로
                      인정됩니다.
                    </p>

                    <p>
                      - 타인의 사진을 도용하였거나, 적립금을 받고 후기를
                      삭제하신 경우 포인트가 통보 없이 회수될 수 있습니다.
                    </p>

                    <p>
                      - 상품과 전혀 관련이 없는 리뷰의 경우 게시중단 처리될 수
                      있으며, 모델에 대한 비난 등의 악성 리뷰어는 최대 영구차단
                      처리될 수 있습니다.
                    </p>
                  </div>

                  <h6 className="mt-2">리뷰 포인트 지급 적용 기준</h6>
                  <div className="review-point-standard mt-1">
                    <p>- 텍스트(20자 이상): 100포인트</p>
                    <p>- 텍스트(500자 이상): 500포인트</p>
                    <p>- 텍스트(20자 이상) + 착용사진: 500포인트</p>
                    <p>- 텍스트(500자 이상) + 착용사진: 1,000포인트</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
